/**********************************************************************/
/**********************无锡矽杰微电子有限公司**************************/
/**********************项目: 各类定义头文件****************************/
/**********************编程: Tina          ****************************/
/**********************时间: 2022.01.06    ****************************/
/**********************************************************************/                
;          __________ 
;   VCC---|VCC   GND |---VSS
;      ---|P65   P60 |---pwm3  
;      ---|P64   P61 |---pwm2  
;      ---|P63   P62 |---pwm1  
;         |__________|
;==================================================
;		端口寄存器定义
;		说明:端口定义，根据实际程序进行修改
;==================================================  
io_key		    	== 	p6.5   
io_ledOut			== 	p6.2 
;========================================================================
;数据定义
;========================================================================
tcc_2				==	0x00		;TCC预分频器使能，分频比1:2;
tcc_4				==	0x01		;TCC预分频器使能，分频比1:4;
tcc_8				==	0x02		;TCC预分频器使能，分频比1:8;
tcc_16				==	0x03		;TCC预分频器使能，分频比1:16;
tcc_32				==	0x04		;TCC预分频器使能，分频比1:32;
tcc_64				==	0x05		;TCC预分频器使能，分频比1:64;
tcc_128				==	0x06		;TCC预分频器使能，分频比1:128;
tcc_256				==	0x07		;TCC预分频器使能，分频比1:256;
;-------------------------------------------------------------------------
data_contw			==	0x02	 	;分频值，8分频  
data_tcc			==  6			;tcc初值 1ms中断一次
;-------------------------------------------------------------------------
;iopage寄存器配置
;-------------------------------------------------------------------------
;data_ioc5Set		==	0b00000000	;P5方向控制寄存器:1输入,0输出
;data_ioc6Set		==	0b00001000	;P6方向控制寄存器:1输入,0输出
;data_ioc9Set		==	0b11111111	;端口上下拉控制寄存器:0使能,1禁止 bit7-bit4对应P67-P64下拉;bit3-bit0对应P53-P50上拉 
;data_iocbSet		==	0b11111111	;端口下拉控制寄存器:0使能,1禁止   bit6-bit4对应P62-P60,bit3-bit0对应P53-P50,P53的下拉需要在option中?鼓?
;data_iocdSet		==	0b11111111	;P6端口上拉控制寄存器:0使能,1禁止 bit7-bit0对应P67-P60
;data_ioceSet		==	0b00000000	;WDT控制寄存器:Bit7:WDTEN-WDT 0:禁止,1:使能;Bit6:EIS-P60 外部中断使能位 0:禁止,1:使能
;data_iocfSet		==	0x01		;中断使能控制,Bit3:T1 中断使能位;Bit2:外部中断使能控制,Bit1:端口状态改变中断使能控制,Bit0:TCC 溢出中断使?芸刂?
;==============================================================
;PWM模块功能设置
;PWMCON pwm控制寄存器		
;PRD	pwm周期寄存器
;PDC1	pwm1占空比寄存器
;PDC2	pwm2占空比寄存器
;PDC3	pwm3占空比寄存器  
;PWM1:P62,PWM2:P61,PWM3:P60
;==============================================================
;data_pwmOff		==	0b00000000	;关闭pwm
;data_PWMCON_set    ==	0b11111000  ;pwm=1/8*2(分频)*4clock*100=100us
;data_PRD_set		==	100			;pwm周期寄存器	
;data_PDC1_set		==	20			;pwm1占空比寄存器,高电平时间=1/8*2(分频)*4clock*20=20us	 
;data_PDC2_set		==	30			;pwm2占空比寄存器
;data_PDC3_set		==	50			;pwm3占空比寄存器

;data_RE_set		==	0b10000000	;bit7=1 PWM1 输出取反
;****************************************
; 所有寄存器定义，以reg开头
;**************************************** 
reg_timeSleep		==	0X20
delay_a				==	0x3b
delay_b				==	0x3c
delay_c				==	0x3d
A_BUFF				==		0X3E
R3_BUFF				==		0X3F

