//*******************************************免责声明*******************************************//
/*无锡矽杰微电子有限公司（简称：无锡矽杰微）保留关于该例程可靠性、功能和设计方面的改进作进一步说明的权利。
由于使用本例程中的信息或内容而导致的直接，间接，特别附带结果的损害，无锡矽杰微没有义务负责。
本例程中代码的应用仅仅是用来做功能演示，本公司不保证这些代码没有更深入的测试就能适用。
本例程中使用的软件，都是依据授权或保密合约所合法提供的，并且只能在这些合约的许可条件下使用或者复制。
无锡矽杰微的产品不是专门设计来应用于生命维持的用具，装置或者系统。无锡矽杰微的产品不支持而且禁止在这些方面的应用。
本例程内容如有变动恕不另作通知，具体更新信息，请参考公司官方网站www.xjmcu.com。*/
//===================================================================================//
//主频：8M/4T  
//IDLE睡眠唤醒-DEMO功能说明：
//1）低速模式下,TCC唤醒IDEL
//2）低速模式下,T1/PWM唤醒IDEL 
//=====================================================*/
//===================================================================================//
//==============================================================================//
//头文件	运用头文件	通用寄存器定义文件
//==============================================================================//
#include "XC8P8600.h"
#include "XJ_8600Define.h"
//===================================//
//void file_clrRam(void);
//void file_init(void);
//void file_project_init(void);
//===================================//
//初始化RAM:10H~3FH
//===================================//
void file_clrRam()
{
	for(RSR=0x90;RSR<0xFF;RSR++)	//清零 BANK0 RAM  IAR-R0,RSR-R4
	{IAR = 0;}
	 IAR = 0;
}
//===================================//
//端口初始化
//===================================//
void file_init(void)
{	
	CONTW(0x02);			//TCC 8分频
	TCC = data_tcc;			//1/2 * 8 * (256-6) = 1000us	公式：1/IRC频率 * 预分频 * （256-初值）
	PORT6 = 0;				//P6口输出低
	IOCP_W(P6CR,0x08);		//P6口设为输出
	IOCP_W(PHDCR,0xff);		//端口上下拉控制寄存器，bit7-bit4对应P67-P64下拉;bit3-bit0对应P53-P50上拉 
	IOCP_W(PDCR,0xff);		//端口下拉控制寄存器，  bit6-bit4对应P62-P60,bit3-bit0对应P53-P50
	IOCP_W(PHCR,0xff);		//P6端口上拉控制寄存器  bit7-bit0对应P67-P60
	IOCP_W(WDTCR,0x00);		//WDT 使能控制寄存器
	IOCP_W(IMR,0x01);		//中断使能控制寄存器 
	ISR = 0x0;				//清TC0中断标志位 
}
//===================================//
//TC0初始化
//===================================//
void file_project_init(void)
{
}
//===================================//
//中断服务程序
//===================================//
void int_isr(void) __interrupt 
{    	
	__asm__("org 0x08");			//中断入口地址			
	PUSH(_A_BUFF,_R3_BUFF);			//中断入栈保护
//=========Tcc中断程序===============//
	if(TCIF)					//判断TCIF是否为1
	{
		TCC	  += 0x06;				//1/2 * 8 * (256-6) = 1000us	公式：1/IRC频率 * 预分频 * （256-初值）
		ISR    = 0xfe;				//清TC0中断标志位
		io_ledOut = !io_ledOut;			//P61口翻转
	}	 
//===============中断程序===============//
	POP(_A_BUFF,_R3_BUFF);			//中断出栈保护恢复
}
//------------------------------------------------------------------
//低速模式下,TCC唤醒IDEL
//TCC定时唤醒时间=TCC*TCC分频*(1/低速RC时钟)=256*2*(1/低速RC时钟)
//------------------------------------------------------------------
void file_tcc_wakeIDEL_set()
{
	CONTW(0X00);		//预分频器分给TCC 07;预分频器分给WDT  32.768ms
	NOP();
	NOP();
	TCC=0;				//TCC定时唤醒时间=TCC*TCC分频*(1/低速RC时钟)=256*2*(1/低速RC时钟)
	IDLE=1;				//1:系统执行 SLEEP 指令时进入空闲模式，系统时钟正常工作
	TCCCKS=1;			//TCC 时钟源选择,1:选择系统时钟
	TCCWE=1;			//1:TCC唤醒使能,可唤醒空闲模式,RTC 模式下可唤醒睡眠以及空闲模式
	CLKMD=1;			//1:系统时钟使用低速 RC 振荡器时钟
	STPHX=1;			//1:停止高速时钟，包括 IRC 和晶振振荡器时钟（不包括 RTC 时钟） 	
}
void file_tcc_exitIDEL_set()//;退出IDEL设置
{ 			
	IDLE=0;				//0:系统执行 SLEEP 指令时进入睡眠模式	
	TCCCKS=0;			//TCC 时钟源选择,0:选择指令周期时钟
	TCCWE=0;				//0:TCC 唤醒禁止	
	STPHX=0;			//0:高速时钟正常工作
	CLKMD=0;			//0:系统时钟使用高速 IRC 或者晶振振荡器时钟 
}
//------------------------------------------------------------------
//低速模式下,T1/PWM唤醒IDEL
//T1/PWM定时唤醒时间=PRD*T1预分频*(1/低速RC时钟)=255*2*(1/低速RC时钟)
//------------------------------------------------------------------
void file_pwm_wakeIDEL_set()
{
	PWMCON = 0x88;			//pwm=255*2(分频)*(1/低速RC时钟)=38ms PWM控制寄存器 T1EN PWM3EN PWM2EN PWM1EN T1PTEN T1PSR<2> T1PSR<1> T1PSR<0> 
	PRD = 255;				//PWM周期寄存器
	NOP();
	NOP();		
	 
	IDLE=1;					//1:系统执行 SLEEP 指令时进入空闲模式，系统时钟正常工作
	PWMWE=1;				//1:PWM 唤醒使能，可唤醒空闲模式 
	PWMCKS=1;				//1:选择系统时钟Fosc
	CLKMD=1;				//1:系统时钟使用低速 RC 振荡器时钟
	STPHX=1;				//1:停止高速时钟，包括 IRC 和晶振振荡器时钟（不包括 RTC 时钟） 
}
void file_pwm_exitIDEL_set()//退出IDEL设置
{
	IDLE=0;					//系统执行 SLEEP 指令时进入睡眠模式	
	PWMCKS=0;				//0:选择指令周期时钟
	PWMWE=0;				//0:PWM 唤醒禁止	
	STPHX=0;				//0:高速时钟正常工作
	CLKMD=0;				//0:系统时钟使用高速 IRC 或者晶振振荡器时钟 
}
//-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=
//***************睡眠程序*****************
//-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=
void 	file_IDLEWake_slep()
{
	for(reg_sleep_cnt=0;reg_sleep_cnt<10;reg_sleep_cnt++)
	{
		DI();
		CWDT();
	//----------------------------------------------------------
		file_tcc_wakeIDEL_set();	//低速模式下，tcc唤醒IDEL 5V供电,12k左右,434.8ms唤醒
		//file_pwm_wakeIDEL_set();	//低速模式下,T1/PWM唤醒IDEL 398ms唤醒 
	//----------------------------------------------------------
	//Slep_Star:
		SLEEP();
		NOP();
		NOP();
	//----------------------------------------------------------
		file_tcc_exitIDEL_set();	//低速模式下，tcc唤醒IDEL
		//file_pwm_exitIDEL_set();	//低速模式下,T1/PWM唤醒IDEL 
	//----------------------------------------------------------
	}
	reg_sleep_cnt = 0;
	io_led2Out=1;	
	NOP();
	NOP();
	io_led2Out=0; 
}	 
//===================================//
//MAIN主程序
//===================================//
void main()
{
	file_clrRam();					//清RAM
	file_init();					//io寄存器初始化
	file_project_init();			//程序所需功能设置
	EI();							//打开总中断
	while(1)
	{	 
		file_IDLEWake_slep();		//IDLE模式唤醒
		NOP();
		NOP();
		NOP();
	}
}
